app/controllers/api_shared_projects_controller.rb

  def create
    @shared_project = SharedProject.new shared_project_params

    if @shared_project.save
---
INSERT INTO "shared_projects" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 04 Mar 2014 19:08:55 UTC +00:00], ["title", "Snake"], ["updated_at", Tue, 04 Mar 2014 19:08:55 UTC +00:00]]