app/controllers/api_users_controller.rb

  def register
    @user = User.new register_params

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def authenticate
    @user = User.find_by_username params[:user][:username]
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'j0jVE7zejKYJ2F' LIMIT 1