app/controllers/api_user_projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 1]]
---
  def index
    @projects = @api_user.projects.page(params[:page]).per(params[:per_page])

INSERT INTO "projects" ("created_at", "description", "title", "updated_at", "user_id", "uuid") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @project = @api_user.projects.find_by_uuid params[:project][:uuid]

    if @project
      @fork = @project.fork @api_user, nil

      if @fork.errors.any?
        render json: { errors: @fork.errors.full_messages }, status: :unprocessable_entity
      else
        render json: @fork.full.except(:username, :screenshot), status: :ok
      end
    else
      @project = @api_user.projects.new user_create_params

      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."uuid" = '865241f0-df1b-4833-bece-9302cb73a899' LIMIT 1  [["user_id", 6]]
---
  def show
    @project = @api_user.projects.find_by_uuid params[:uuid]

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."uuid" = '8c9926f6-3ff8-4db4-982f-043f03f32540' LIMIT 1  [["user_id", 10]]
---
  def update
    @project = @api_user.projects.find_by_uuid params[:uuid]