app/controllers/projects_controller.rb

  def show
    @project = Project.find_by_id params[:id]
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 38 LIMIT 1