app/controllers/shared_projects_controller.rb

  def create
    @shared_project = SharedProject.new shared_project_params

    if @shared_project.save
---
INSERT INTO "shared_projects" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 25 Feb 2014 19:06:04 UTC +00:00], ["description", "Use the ball to breakout of the blocks."], ["title", "Breakout"], ["updated_at", Tue, 25 Feb 2014 19:06:04 UTC +00:00]]

  def show
    @shared_project = SharedProject.find_by_id params[:id]
---
SELECT "shared_projects".* FROM "shared_projects" WHERE "shared_projects"."id" = 0 LIMIT 1